{
  "signinup": {
    "autoris": "Аўтарызацыя",
    "autorised": "Вы аўтарызаваныя як",
    "login": "Увайсці",
    "logout": "Выйсці",
    "willregistr": "Зарэгістравацца",
    "notregistr": "Без регістрацыі",
    "registr": "Регістрацыя",
    "nickname": "Ваш нікнэйм:",
    "email": "Ваша пошта:",
    "password": "Пароль:",
    "send": "Адправіць",
    "registred": "Вы зарэгістраваныя",
    "startgame": "Пачаць гульню",
    "yourprofile": "Асабісты кабінет",
    "play": "Гуляць",
    "rules": "Правілы",
    "min2Sumb": "Мінімум 2 сімвала!",
    "min8Sumb": "Мінімум 8 сімвалаў!",
    "requiredField": "Абавязковае поле!",
    "emailError": "Няверны email адрас!",
    "loginError": "Няверны лагін!",
    "passwordError": "Няверны пароль!",
    "doubleName": "Такое імя ўжо ёсць"
  },
  "gameover": {
    "gameover": "Гульня завершана!",
    "playagain": "Згуляць яшчэ раз",
    "youresult": "Ваш выйгрыш:",
    "exitmenu": "Выхад у меню",
    "points": "балаў",
    "nextquestion": "Наступнае пытанне"
  },
  "hint": {
    "condition": "Запомніце камбінацыю лічбаў!",
    "backToQuestion": "Да пытання",
    "requirement": "Паўтарыце ўбачаную камбінацыю!",
    "probability": "Верагоднасць",
    "answer": "адказ"
  },
  "rules": {
    "header": "Гульня 'хто хоча стаць праграмістам?'",
    "description": "Увага! Пасля гэтай гульні вы ніколі не будзеце на ранейшым узроўні ў сваім развіцці па мастацтве праграмавання! Таму вырашыце для сябе ці вы хочаце пагрузіцца ў свет it і стаць крутым праграмістам, назад дарогі не будзе! Гульня ўяўляе сабой аналаг вядомай гульні 'Хто хоча стаць мільянерам' з кантэкстам пытанняў па тэматыцы праграмавання (у прыватнасці front-end распрацоўкі).",
    "authorization": "У гульні выкарыстоўваецца браузерная рэгістрацыя, гэта значыць дадзеныя розных карыстачоў могуць захоўвацца ў лакальным сховішчы браўзэра дадзенага кампутара. І на ім могуць гуляць розныя карыстачы, што зручна для сямейнай гульні. Пры аўтарызацыі, карыстач атрымлівае асабісты кабінет, дзе будзе захоўвацца яго статыстыка - колькасць гульняў і сума ўсіх выйграных мегабайт. Можна гуляць і без рэгістрацыі, але тады не будзе асабістага кабінета і не будзе асабістай статыстыкі.",
    "languages": "Гульня мае кантэнт на трох мовах: англійскай, рускай і беларускай.",
    "core": "Удзельнік адказвае на пытанні, якія яму прапануюцца, на кожнае пытанне прадастаўляецца 30 секунд, за выключэннем сітуацый пры выкарыстанні падказак. Пры правільным адказе на пытанне, гулец пераходзіць у прамежкавую старонку з вынікам бягучага прагрэсу і працягвае гульню атрымліваючы наступнае пытанне. Усяго 15 пытанняў, дыферэнцыраваных ад простых да складаных. Пры дакладных адказах гулец атрымлівае пэўную суму мегабайт, ад 100 да 1000000. Пры дакладным адказе на 5 першых пытанняў, а потым на 10, бягучая сума становіцца незгаральнай, гэта значыць пры вылеце з гульні ў далейшым гулец гарантавана яе атрымае. Пры вылеце з гульні да 5 пытання гулец атрымлівае 0. Пры не ўпэўненасці ў правільнасці адказу на пытанне можна забраць бягучую суму націснуўшы на кнопку з грашовым мяшком, якая азначае 'забраць вынік'. Пры тэрміновай неабходнасці заняцца іншымі справамі можна пакінуць гульню націснуўшы на кнопку з дзвярыма і стрэлкай, якая азначае выйсце з дадзенай цудоўнай гульні. У статыстыку гэтая гульня не пойдзе.",
    "hints": {
      "description": "Пры няўпэўненасці ў правільным адказе ў гульні прапануюцца 3 падказкі, кожнай з якіх можна скарыстацца толькі раз.",
      "hintFiftyFifty": "1) 50:50 - пры выкарыстанні дадзенай падказкі прыбіраюцца два няправільных адказу з чатырох, і гульцу застанецца абраць з двух варыянтаў, што нашмат павялічвае шанцы адказаць дакладна.",
      "hintCall": "2) Званок- пры дадзенай арыгінальнай падказцы вам прапануецца згуляць у міні гульню, у якой на аналогу тэлефоннай клавіятуры будуць па чарзе падсветлены 10 лічбаў у хаатычным парадку, пасля надпісу на дысплеі 'паўторыце камбінацыю лічбаў' вам трэба ўвесці такую ​​ж або прыблізна такую ​​ж камбінацыю лічбаў, працэнтныя суадносіны угаданых лічбаў, будуць выведзены на дысплей і з такой жа працэнтнай верагоднасцю будзе прапанаваны правільны адказ на пытанне.",
      "hintBoolean": "3) Булеан - дадзеная арыгінальная падказка дадасць да пытання нейкае js значэнне, якое можа быць прыведзена альбо да true альбо да false. Натуральна выраз з патэнцыялам true будзе каля дакладнага адказу."
    },
    "conclusion": "Мы ўклалі душу ў дадзеную гульню і спадзяемся Вам будзе прыемна ў яе пагуляць, і сумясціць прыемнае баўленне часу з карысцю ў развіцці сваіх навыкаў праграмавання) Удачы!"
  }
}
