{
  "signinup": {
    "autoris": "Авторизация",
    "autorised": "Вы авторизированы как",
    "login": "Войти",
    "logout": "Разлогиниться",
    "willregistr": "Зарегистрироваться",
    "notregistr": "Вход без регистрации",
    "registr": "Регистрация",
    "nickname": "Ваш никнейм:",
    "email": "Ваша почта:",
    "password": "Пароль:",
    "send": "Отправить",
    "registred": "Вы зарегистрированы",
    "startgame": "Начать игру",
    "yourprofile": "Личный кабинет",
    "play": "Играть",
    "rules": "Правила",
    "min2Sumb": "Минимум 2 символа!",
    "min8Sumb": "Минимум 8 символов!",
    "requiredField": "Обязательное поле!",
    "emailError": "Неправильный email адрес!",
    "loginError": "Неправильный логин!",
    "passwordError": "Неправильный пароль!",
    "doubleName": "Такое имя уже есть"
  },
  "gameover": {
    "gameover": "Игра закончена!",
    "playagain": "Сыграть еще раз",
    "youresult": "Ваш выигрыш:",
    "exitmenu": "Выход в меню",
    "points": "баллов",
    "nextquestion": "Следующий вопрос"
  },
  "hint": {
    "condition": "Запомните комбинацию цифр!",
    "backToQuestion": "Назад к вопросу",
    "requirement": "Повторите увиденную комбинацию!",
    "probability": "Вероятность",
    "answer": "ответ"
  },
  "rules": {
    "header": "Игра 'кто хочет стать программистом?'",
    "description": "Внимание! После данной игры вы никогда не будете на прежнем уровне в своем развитии по искусству программирования! Поэтому решите для себя хотите ли вы погрузится в мир it и стать крутым программистом, назад дороги не будет! Игра представляет собой аналог известной игры 'Кто хочет стать миллионером' с контекстом вопросов по тематики программирования (в частности front-end разработки).",
    "authorization": "В игре используется браузерная регистрация, то есть данные разных пользователей могут храниться в локальном хранилище браузера данного компьютера. И на нем могут играть разные пользователи, что удобно для семейной игры. При авторизации, пользователь получает личный кабинет, где будет храниться его статистика - количество игр и сумма всех выигранных мегабайт. Можно играть и без регистрации, но тогда не будет личного кабинета и не будет личной статистики.",
    "languages": "Игра имеет контент на трёх языках: английском, русском и белорусском.",
    "core": "Участник отвечает на предлагаемые ему вопросы, на каждый вопрос предоставляется 30 секунд, за исключением ситуаций при использовании подсказок. При правильном ответе на вопрос, игрок переходит в промежуточную страницу с результатом текущего прогресса и продолжает игру получая следующий вопрос. Всего 15 вопросов, дифференцированных от простых к сложным. При верных ответах игрок получает определенную сумму мегабайт, от 100 до 1000000. При верном ответе на 5 первых вопросов, а потом на 10, текущая сумма становится несгораемой, то есть при вылете из игры в дальнейшем игрок гарантированно ее получит. При вылете из игры до 5 вопроса игрок получает 0. При не уверенности в правильности ответа на вопрос можно забрать текущую сумму нажав на кнопку с денежным мешком, означающую 'забрать результат'. При срочной необходимости заняться другими делами можно покинуть игру нажав на кнопку с дверью и стрелкой, означающей выход из данной великолепной игры. В статистику данная игра не пойдет.",
    "hints": {
      "description": "При неуверенности в правильном ответе в игре предлагаются 3 подсказки, каждой из которых можно воспользоваться лишь раз.",
      "hintFiftyFifty": "1) 50:50 - при использовании данной подсказки убираются два неправильных ответа из четырех, и игроку останется выбрать из двух вариантов, что намного увеличивает шансы ответить верно.",
      "hintCall": "2) Звонок- при данной оригинальной подсказке вам предлагается сыграть в мини игру, в которой на аналоге телефонной клавиатуры будут по очереди подсвечены 10 цифр в хаотичном порядке, после надписи на дисплее 'повторите комбинацию цифр' вам надо ввести такую же или приблизительно такую же комбинацию цифр, процентное соотношение угаданных цифр, будет выведено на дисплей и с такой же процентной вероятностью будет предложен верный ответ на вопрос.",
      "hintBoolean": "3) Булеан- данная оригинальная подсказка добавит к вопросом некое js значение, которое может быть приведено либо к true либо к false. Естественно выражение с потенциалом true будет около верного ответа."
    },
    "conclusion": "Мы вложили душу в данную игру и надеемся Вам будет приятно в нее поиграть, и совместить приятное времяпровождение с пользой в развитии своих навыков программирования) Удачи!"
  }
}
