export const congratEn = {
	0: "Sorry, but you didn't win anything.",
	100: "We're sorry, but you have a minimum score.",
	200: 'Your winnings are very modest.',
	300: 'Not a bad game, try again.',
	500: '500 points is not bad.',
	1000: 'You have the first fireproof win.',
	2000: "Don't worry, you'll be fine",
	4000: 'Фраза на 4000 баллов',
	8000: 'Фраза на 8000 баллов',
	16000: 'Фраза на 16000 баллов',
	32000: 'Поздравляем, вам не много не хватило да максимального бала.',
	64000: 'Поздравляем, вы очень хороший программист.'
};

export const congratBl = {
	0: 'Выбачайце, але ў вас няма выігрышу.',
	100: 'Шкада, але ў вас мінімальны бал.',
	200: 'Ваш выігрыш вельмі сціплы.',
	300: 'Не дрэнная гульня, паспрабуйце яшчэ.',
	500: '500 балаў - гэта ўжо не дрэнна.',
	1000: 'У вас першы незгаральны выігрыш.',
	2000: 'Не хвалюйцеся, у вас усё атрымаецца.',
	4000: 'Не дрэнны вынік, у вас ўсё яшчэ на перадзе.',
	8000: 'Фраза на 8000 баллов',
	16000: 'Фраза на 16000 баллов',
	32000: 'Поздравляем, вам не много не хватило да максимального бала.',
	64000: 'Поздравляем, вы очень хороший программист.',
    125000: '',
    250000: '',
    500000: '',
    1000000: ''
};

export const congratRu = {
	0: 'Извините, но вы ничего не выиграли.',
	100: 'Нам жаль, но у вас минимальный бал.',
	200: 'Ваш выигрыш очень скромный.',
	300: 'Не плохая игра, попробуйте еще раз.',
	500: '500 баллов - это уже не плохо.',
	1000: 'У вас первый несгораемый выигрыш.',
	2000: 'Не переживайте, у вас все получиться',
	4000: 'Фраза на 4000 баллов',
	8000: 'Фраза на 8000 баллов',
	16000: 'Фраза на 16000 баллов',
	32000: 'Поздравляем, вам не много не хватило да максимального бала.',
	64000: 'Поздравляем, вы очень хороший программист.'
};